

#Область ПрограммныйИнтерфейс
// Определяет состав программного интерфейса для интеграции с конфигурацией.
//
// Параметры:
//   Настройки - Структура - Настройки интеграции этого объекта.
//       См. возвращаемое значение функции ПодключаемыеКоманды.НастройкиПодключаемыхОтчетовИОбработок().
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт
    Настройки.Размещение.Добавить(Метаданные.Документы.ЗаказПоставщику);
	//Настройки.Размещение.Добавить(Метаданные.Документы.ПриходнаяНакладная);
	//Настройки.Размещение.Добавить(Метаданные.Документы.РасходнаяНакладная);
    Настройки.ДобавитьКомандыПечати = Истина;
КонецПроцедуры
// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - Подробнее см. в УправлениеПечатью.СоздатьКоллекциюКомандПечати().
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Инв_ПечатьТабЧастиЗапасы";
	КомандаПечати.Представление = НСтр("ru = 'Инв: Печать тч Запасы'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 999;
КонецПроцедуры
#КонецОбласти
// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ОписаниеПечатнойФормы = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Инв_ПечатьТабЧастиЗапасы");
	Если ОписаниеПечатнойФормы <> Неопределено Тогда
		
		ОписаниеПечатнойФормы.ТабличныйДокумент = Новый ТабличныйДокумент;
		ОписаниеПечатнойФормы.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Инв_ПечатьТабЧастиЗапасы";
		ОписаниеПечатнойФормы.ПолныйПутьКМакету = "Обработка.Инв_ПечатьТабЧастиЗапасы.ПФ_MXL_Запасы";
		ОписаниеПечатнойФормы.СинонимМакета = НСтр("ru ='Инв: Печать тч Запасы'");
		
		СформироватьПечатнуюФорму(ОписаниеПечатнойФормы, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФорму(ОписаниеПечатнойФормы, МассивОбъектов, ОбъектыПечати)
	
	Перем ПервыйДокумент, НомерСтрокиНачало, Ошибки;
	
	ТабличныйДокумент	= ОписаниеПечатнойФормы.ТабличныйДокумент;
	Макет				= УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
	
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ДопСвойствоРазмерЛота = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Инв_РазмерЛота");
	
	ИспользуемыеТипы = Новый Массив;
	ИспользуемыеТипы.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	//ИспользуемыеТипы.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	//ИспользуемыеТипы.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекТип Из ИспользуемыеТипы Цикл
		
		ТекМассивОбъектов = Новый Массив;
		Для Каждого ТекОбъект Из МассивОбъектов Цикл
			Если ТипЗнч(ТекОбъект) = ТекТип Тогда 
				ТекМассивОбъектов.Добавить(ТекОбъект);
			КонецЕсли;
		КонецЦикла;
		
		Если ТекМассивОбъектов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивОбъектов", ТекМассивОбъектов);
		Запрос.УстановитьПараметр("ДопСвойствоРазмерЛота", ДопСвойствоРазмерЛота);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Запасы.Ссылка КАК Документ,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Количество КАК Количество,
		|	Запасы.Цена КАК Цена,
		|	НоменклатураДополнительныеРеквизиты.Значение КАК РазмерЛота
		|ИЗ
		|	Документ.ЗаказПоставщику.Запасы КАК Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО Запасы.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство = &ДопСвойствоРазмерЛота)
		|ГДЕ
		|	Запасы.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Запасы.Ссылка,
		|	Запасы.НомерСтроки
		|ИТОГИ ПО
		|	Документ";
		
		МетаДок = Метаданные.НайтиПоТипу(ТекТип);
		ИмяТаблицы = МетаДок.Имя;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ЗаказПоставщику.Запасы", "Документ." + ИмяТаблицы + ".Запасы");
		
		ВыборкаПоДокументам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоДокументам.Следующий() Цикл
			
			Если ПервыйДокумент Тогда
				ПервыйДокумент = Ложь;
			Иначе
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ОблЗаголовок.Параметры.Документ = ВыборкаПоДокументам.Документ;
			ТабличныйДокумент.Вывести(ОблЗаголовок);
			ТабличныйДокумент.Вывести(ОблШапка);
			
			СуммаИтого = 0;
			
			Выборка = ВыборкаПоДокументам.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ОблСтрока.Параметры.Заполнить(Выборка);
				
				Сумма = Выборка.Количество * Выборка.РазмерЛота * Выборка.Цена;
				ОблСтрока.Параметры.Сумма = Сумма;
				
				СуммаИтого = СуммаИтого + Сумма;
				
				ТабличныйДокумент.Вывести(ОблСтрока);
				
			КонецЦикла;
			
			ОблПодвал.Параметры.Сумма = СуммаИтого;
			
			ТабличныйДокумент.Вывести(ОблПодвал);
			
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()
